backend/controllers/VehicleController.php

SELECT * FROM `vehicle` WHERE (`id`='2') AND (`users_id`='1')
---
    protected function findModel($id, $users_id)
    {
        if (($model = Vehicle::findOne(['id' => $id, 'users_id' => $users_id])) !== null) {