frontend/views/vehicle/mygarage.php

		<div class="row">
        <section class="cover_photo" >
       <div class="col-lg-12"> <a href="<?php echo Yii::getAlias('@web') ?>/index.php?r=vehicle%2Fcreate&id=<?php echo Yii::$app->user->id ?>" class="add_vichel">+ Add Vehicle</a></div>
       <?php $veh=  frontend\models\Vehicle::findAll(["users_id" => Yii::$app->user->id]);
---
SELECT * FROM `vehicle` WHERE `users_id`=1